In [6]:
import pandas as pd

In [7]:
from sqlalchemy import create_engine
engine = create_engine('postgres://aubreymoore:canada12@localhost/import_test')

In [8]:
pd.set_option('display.max_rows', 4)
pd.options.display.max_colwidth = 100

df_taxon2 = pd.read_sql_query('select tid, name from taxon2',con=engine)
df_taxon2

         tid                 name
0          6              Plantae
1    7707728         Tracheophyta
..       ...                  ...
803  3177662              Eugenia
804  7907394  Eugenia malaccensis

[805 rows x 2 columns]

In [9]:
integers_only = pd.to_numeric(df_taxon2.tid, errors='coerce').notnull()

In [10]:
df_taxon2 = df_taxon2[integers_only]
df_taxon2

         tid                 name
0          6              Plantae
1    7707728         Tracheophyta
..       ...                  ...
803  3177662              Eugenia
804  7907394  Eugenia malaccensis

[778 rows x 2 columns]

In [12]:
df_taxon = pd.read_sql_query('select id, name from taxon',con=engine)
df_taxon

       id               name
0    1625           Animalia
1    1626         Arthropoda
..    ...                ...
803  2429  Solanum melongena
804  2430  Solanum tuberosum

[805 rows x 2 columns]

In [14]:
df_merged = df_taxon2.merge(right=df_taxon, on='name')
df_merged

# Column mapping

# tid -> name1.name (this is the GBIF ID)
# name (delete this column)
# id -> name1.taxon (this is the FK which links to the taxon field)
# name1.name_type = 1 (add this column; 1 is the code for "GBIF ID")

         tid                 name    id
0          6              Plantae  2292
1    7707728         Tracheophyta  2293
..       ...                  ...   ...
776  3177662              Eugenia  2401
777  7907394  Eugenia malaccensis  2402

[778 rows x 3 columns]

In [27]:
df_merged.columns = ['name1.name', 'name1.name_type', 'name1.taxon']
df_merged['name1.name_type'] = 1
df_merged
df_merged.to_csv('gbifids.csv', index=False)

# Read CSV back for inspection.

In [28]:
pd.read_csv('gbifids.csv')

     name1.name  name1.name_type  name1.taxon
0             6                1         2292
1       7707728                1         2293
..          ...              ...          ...
776     3177662                1         2401
777     7907394                1         2402

[778 rows x 3 columns]

# Read the CSV template for the name1 table

In [18]:
df_name1 = pd.read_csv('db_name1.csv')
df_name1

     name1.id  name1.taxon  name1.name_type         name1.name
0           2         1625                2           Animalia
1           3         1626                2         Arthropoda
..        ...          ...              ...                ...
803       806         2429                2  Solanum melongena
804       807         2430                2  Solanum tuberosum

[805 rows x 4 columns]

# Read name_type table

In [20]:
pd.read_sql_table('name_type', engine)

    id                 name_type
0    1                   GBIF ID
1    2  accepted scientific name
..  ..                       ...
6    7      vernacular (English)
7    8     vernacular (Chamorro)

[8 rows x 2 columns]